import React, { useState } from 'react';
import './App.css';

const getRandomInt = (max) => {
  return Math.floor(Math.random() * max);
};

const generateRandomCharacter = () => {
  const professions = [
    {
        name: '3D Անիմատոր',
        possibility: 'Կարող է ավելացնել "Ճամպրուկում" պլանշետ լիցքավորիչով․'
      },
      {
        name: 'Դիմորդ',
        possibility: 'Կարող է փոխել իր" մասնագիտությունը " պատահականորեն, եթե նա 27 տարեկանից բարձր է: Հակառակ դեպքում դառնում է զինվոր․'
      },
      {
        name: 'Բանկի գործակալ',
        possibility: 'Կարող է պայմանագիր կնքել մեկ բունկերի հետ. թշնամու բունկերը դառնում է ընկերական, իսկ ընկերականը ՝ թշնամական:'
      },
      {
        name: 'Գյուղատնտես',
        possibility: 'Կարող է ավելացնել "Ճամպրուկում" մթերքներով լի արկղ.'
      },
      {
        name: 'Փաստաբան',
        possibility: 'Մեկ անգամ մեկ խաղում կարող է վերահասցեավորել ուրիշի ձայնը իր դեմ քվեարկությունից հետո.'
      },
      {
        name: 'Ադմինիստրատոր',
        possibility: 'Կարող է լուծել ցանկացած խնդիր բունկերում (բացառությամբ անօթեւանի).'
      },
      {
        name: 'Ձայնային դերասան',
        possibility: 'Յուրաքանչյուր խաղում մեկ անգամ կարող է 30 վայրկյանով նվազեցնել ցանկացած խաղացողի ելույթը կամ ավելացնել խոսելու ժամանակը.'
      },
      {
        name: 'Դերասան / Դերասանուհի',
        possibility: 'Կարող է օգտագործել մասնագիտական հնարավորությունը ցանկացած խաղացողի փոխարեն.'
      },
      {
        name: 'Մանկաբարձ',
        possibility: 'Երբ անցնում է բունկեր կարող է օգնել ծննդաբերել ցանկացած կազմվածքով կանանց.'
      },
      {
        name: 'Վերլուծաբան',
        possibility: 'Կարող է բացահայտել ցանկացած խաղացողի ցանկացած բնութագիր, որն արդեն բաց է խաղացողների կեսի մոտ.'
      },
      {
        name: 'Անդրոլոգ',
        possibility: 'Կարող է փոխել սեռը հակառակ մեկ այլ խաղացողի (տարիքը և երեխայի կարգավիճակը պահպանվում են).'
      },
      {
        name: 'Անտիկվար',
        possibility: 'Կարող է ցանկացած խաղացողի ավելացնել լրացուցիչ "ճամպրուկ" (ներառյալ ինքն իրեն).'
      },
      {
        name: 'Մարդաբան',
        possibility: 'Կարող է փոխել "ֆոբիան / վախը" ցանկացած խաղացողի.'
      },
      {
        name: 'Արտիստ',
        possibility: 'Կարող է օգտագործել մասնագիտական հնարավորությունը ցանկացած խաղացողի փոխարեն.'
      },
      {
        name: 'Հնագետ',
        possibility: 'Կարող է բահ և 2 ջահ ավելացնել իր "ճամպրուկում".'
      },
      {
        name: 'Ճարտարապետ',
        possibility: 'Կարող է վերաբաշխել բունկերը.'
      },
      {
        name: 'Աստղագուշակ',
        possibility: 'Կարող է "լրացուցիչ մանրամասներ" ավելացնել խաղացողին նրանից հետո.'
      },
      {
        name: 'Աստղագետ',
        possibility: 'Կարող է աստղադիտակ ավելացնել իր "ճամպրուկում".'
      },
      {
        name: 'Աստղաֆիզիկոս',
        possibility: 'Կարող է աստղադիտակ ավելացնել իր "ճամպրուկում".'
      },
      {
        name: 'Բանկիր',
        possibility: 'Կարող է պայմանագիր կնքել մեկ բունկերի հետ. թշնամու բունկերը դառնում է ընկերական, իսկ ընկերականը ՝ թշնամական.'
      },
      {
        name: 'Բարիստա',
        possibility: 'Կարող է սուրճի հատիկներով Պարկ ավելացնել իր "ճամպրուկում".'
      },
      {
        name: 'Բարմեն',
        possibility: 'Կարող է ցանկացած խաղացողի ավելացնել "ալկոհոլիզմ (մեղմ աստիճան)" առողջական վիճակը: Այդ խաղացողի առողջությունը նոր "ալկոհոլիզմի" առաջացման դեպքում անհետանում է.'
      },
      {
        name: 'Հայր',
        possibility: 'Կարող է փոխել "մարդկային հատկություն" բնութագիրը մեկ այլ խաղացողի համար.'
      },
      {
        name: 'Գրադարանավար',
        possibility: 'Կարող է իր "Ճամպրուկում" ավելացնել գրքերի մի կույտ (ընտրության համար) և միավորներ.'
      },
      {
        name: 'Գործարար',
        possibility: 'Կարող է վերցնել  վտարված խաղացողի բաց "ճամպրուկը" .'
      },
      {
        name: 'Կենսաբան',
        possibility: 'Իր "ճամպրուկի" մեջ ավելացնում է մշակաբույսերի, բանջարեղենի սերմեր.'
      },
      {
        name: 'Կենսաֆիզիկոս',
        possibility: 'Կարող է մանրադիտակ ավելացնել իր "ճամպրուկում".'
      },
      {
        name: 'Կենսաքիմիկոս',
        possibility: 'Երբ անցնում է բունկեր կարող է կատարել վիտամիններ մեկ ամսվա ընթացքում.'
      },
      {
        name: 'Կենսաէկոլոգ',
        possibility: 'Կարող է փոխել բունկերի գտնվելու վայրը "անտառում", "լճի մոտ", "գետի մոտ", "ծովի մոտ", "լեռան վրա" կամ "ձորում".'
      },
      {
        name: 'Բուսաբան',
        possibility: 'Կարող է իր "ճամպրուկում" ավելացնել ցանկացած բույսի սերմեր.'
      },
      {
        name: 'Բրոքեր',
        possibility: 'Կարող է պայմանագիր կնքել մեկ բունկերի հետ. թշնամու բունկերը դառնում է ընկերական, իսկ ընկերականը ՝ թշնամական:'
      },
      {
        name: 'Հացթուխ',
        possibility: 'Կարող է 2 շաբաթ թարմ գլանափաթեթներ ավելացնել իր "ճամպրուկում".'
      },
      {
        name: 'Հորատիչ',
        possibility: 'Կարող է լիցքավորվող մարտկոցով Գայլիկոն(դռել) ավելացնել իր "Ճամպրուկ" - ին.'
      },
      {
        name: 'Հաշվապահ',
        possibility: 'Կարող է փոխել սննդի քանակը բունկերում 1,5 անգամ.'
      },
      {
        name: 'Ժամացույց',
        possibility: 'Կարող է իր "ճամպրուկում" ավելացնել սեյֆ.'
      },
      {
        name: 'Վեբ դիզայներ',
        possibility: 'Լիցքավորիչով պլանշետ է ավելացնում իր "Ճամպրուկին".'
      },
      {
        name: 'Անասնաբույժ',
        possibility: 'Ցանկացած կենդանու (մինչև 50 կգ) կարող է  ավելացնել իր "ճամպրուկում":'
      },
      {
        name: 'Տեսանկարահանող',
        possibility: 'Կարող է իր "ճամպրուկին" ավելացնել գոյատևման մի քանի սկավառակ: Դիտել է գոյատևման բոլոր ֆիլմերը.'
      },
      {
        name: 'Դիմահարդար',
        possibility: 'Կարող է փոխել խաղացողի տարիքը "Երիտասարդ" (սեռը պահպանվում է), բացի իրենից.'
      },
      {
        name: 'Գինեգործ',
        possibility: 'Երբ անցնում է բունկեր, նա կարող է իր հետ տանել գինու տուփ.'
      },
      {
        name: 'Վիրուսաբան',
        possibility: 'Կարող է ավելացնել իր "Ճամպրուկ"  Ունիվերսալ շիճուկ օդակաթիլային վարակների դեմ (1 հատ).'
      },
      {
        name: 'Խանութի սեփականատեր',
        possibility: 'Երբ մտնում է բունկեր, ավելացնում է սնունդ +3 ամիս.'
      },
      {
        name: 'Ջրասուզակ',
        possibility: 'Կարող է իր "ճամպրուկում" ավելացնել սուզվելու պարագաներ:'
      },
      {
        name: 'Զինծառայող',
        possibility: 'Կարող է իր "ճամպրուկում" ավելացնել ատրճանակ և 28 փամփուշտ.'
      },
      {
        name: 'Ռազմական բժիշկ',
        possibility: 'Կարող է բուժել ցանկացած "մեղմ հիվանդություն" և "միջին հիվանդություն" դեպի  "Կատարյալ առողջ" մեկ այլ խաղացողի.'
      },
      {
        name: 'Ռազմական ինժեներ',
        possibility: 'Կարող է գործիքների տուփ ավելացնել իր "ճամպրուկում" և լուծել բունկերում ջեռուցման խնդիրները.'
      },
      {
        name: 'Ռազմական օդաչու',
        possibility: 'Կարող է պարաշյուտիստի սարքավորումներ ավելացնել իր "ճամպրուկում" .'
      },
      {
        name: 'Գող',
        possibility: 'Կարող է գողանալ մեկ այլ խաղացողի "ճամպրուկը".'
      },
      {
        name: 'Մանկավարժ',
        possibility: 'Կարող է թույլ տալ, որ երեխաները տեղ չզբաղեցնեն բունկերում.'
      },
      {
        name: 'Գաստրոէնտերոլոգ',
        possibility: 'Կարող է բուժել մարսողական տրակտի հիվանդությունը մինչև "կատարյալ առողջ": * Չի կարող կիրառվել խաղացողի համար, որի հիվանդության աստիճանը "կրիտիկական"է.'
      },
      {
        name: 'Խաղային դիզայներ',
        possibility: 'Կարող է անձնական նոութբուք ավելացնել իր "ճամպրուկում".'
      },
      {
        name: 'Գեյմեր',
        possibility: 'Գիտի մի քանի արժեքավոր խորհուրդներ, թե ինչպես գոյատևել ծայրահեղ իրավիճակում ՝ անցնելով գոյատևման բոլոր խաղերը.'
      },
      {
        name: 'Արյունաբան',
        possibility: 'Կարող է բուժել "մեղմ" և "միջին" արյան հիվանդությունը դեպի "կատարյալ առողջ" ցանկացած խաղացողի համար․'
      },
      {
        name: 'Գենետիկ',
        possibility: 'Անցնելիս բունկեր զգալիորեն բարձրացնում է առողջ երեխաներ ունենալու հնարավորությունը.'
      },
      {
        name: 'Աշխարհագրագետ',
        possibility: 'Կարող է իր "ճամպրուկում" ավելացնել տարածքի քարտեզը.'
      },
      {
        name: 'Երկրաբան',
        possibility: 'Կարող է իր "ճամպրուկում" ավելացնել կիրկա և բահ.'
      },
      {
        name: 'Գերոնտոլոգ',
        possibility: 'Կարող է փոխել ցանկացած խաղացողի տարիքը "տարեց" - ից "մեծահասակ".'
      },
      {
        name: 'Գիդ-թարգմանիչ',
        possibility: 'Կարող է իր "Ճամպրուկում" ավելացնել ծայրահեղ պայմաններում գոյատևման ուղեցույց.'
      },
      {
        name: 'Գինեկոլոգ',
        possibility: 'Կարող է բուժել կանանց վերարտադրողական համակարգի "մեղմ" և "միջին" հիվանդությունը մինչև "կատարյալ առողջ" ցանկացած խաղացողի.'
      },
      {
        name: 'Հիպնոսացնող',
        possibility: 'Կարող է փոխել "ֆոբիան / վախը" ցանկացած խաղացողի.'
      },
      {
        name: 'Սպասուհի',
        possibility: 'Կարող է ինքն իր "ճամպրուկում" ավելացնել ախտահանման հավաքածու.'
      },
      {
        name: 'Գրիմեր',
        possibility: 'Կարող է նվազեցնել / բարձրացնել մեկ այլ խաղացողի տարիքը 5 տարով.'
      },
      {
        name: 'Բանվոր',
        possibility: 'Կարող է փոխել իր "կազմվածքը" դեպի "ամուր".'
      },
      {
        name: 'Բեռնատարի վարորդ',
        possibility: 'Կարող է իր "ճամպրուկում" ավելացնել ամսագրերի մի կույտ.'
      },
      {
        name: 'Համտեսող',
        possibility: 'Կարող է իր "ճամպրուկում" ավելացնել 10 լիտր: ցանկացած խմիչք: Անխոցելի է" ֆոբիաների / վախերի " և ալկոհոլի հետ կապված հիվանդությունների նկատմամբ.'
      },
      {
        name: 'Դեզինսեկտոր',
        possibility: 'Երբ նա մտնում է բունկեր, նա կարող է հեռացնել կրծողների և միջատների հետ կապված խնդիրները, ինչպես նաև պաշտպանիչ կոստյում ավելացնել իր "ճամպրուկում" .'
      },
      {
        name: 'Պատգամավոր',
        possibility: 'Կարող է ավելացնել իր խոսքի ժամանակը 30 վայրկյանով.'
      },
      {
        name: 'Դիզայներ',
        possibility: 'Կարող է ցանկացած խաղացողի "երիտասարդ" դարձնել: * Սեռը և երեխայի կարգավիճակը պահպանվում են.'
      },
      {
        name: 'Հաղորդավար',
        possibility: 'Կարող է ավելացնել 30 վայրկյան Մենախոսություն ցանկացած խաղացողի.'
      },
      {
        name: 'Դիվանագետ',
        possibility: 'Կարող է կապ հաստատել հարազատների, ընկերների, թշնամիների և այլնի հետ: (ներառյալ իրեն).'
      },
      {
        name: 'Տնօրեն',
        possibility: 'Կարող է փոխանակել իր  "մասնագիտությունը" վտարված խաղացողի հետ.'
      },
      {
        name: 'Բժիշկ',
        possibility: 'Կարող է բուժել ցանկացած հիվանդություն, որի աստիճանը "մեղմ" կամ "միջին" է ցանկացած խաղացողի համար, բացի իրենից.'
      },
      {
        name: 'Փաստաթղթագետ',
        possibility: 'Կարող է բացահայտել ցանկացած խաղացողի "լրացուցիչ տեղեկություն" .'
      },
      {
        name: 'Կթվորուհի',
        possibility: 'Կարող է կով ավելացնել իր "ճամպրուկում".'
      },
      {
        name: "Անասնաբույծ",
        possibility: "Կարող է իր 'ճամպրուկում' կենդանիների սննդի տոպրակ: Անխոցելի է կենդանիների հետ կապված 'ֆոբիաների/վախերի' նկատմամբ: "
      },
      {
        name: "Ժոկեյ",
        possibility: "Կարող է իր ճամպրուկում ձի ավելացնել:"
      },
      {
        name: "Լրագրող",
        possibility: "Կարող է լրացուցիչ հայտնել իր կարծիքը քվեարկությունից անմիջապես առաջ 30 վայրկյանի ընթացքում."
      },
      
      {
        name: "Դպրոցի ուսմասվար",
        possibility: "Կարող է ցանկացած խաղացողի բարձրացնել մասնագիտության փորձը 1-ով."
      },
      
      {
        name: "Բենզալցակայանի աշխատող",
        possibility: "Կարող է իր ճամպրուկում ավելացնել բենզինի 2 բանկա."
      },
      
      {
        name: "Ձայնային ինժեներ",
        possibility: "Կարող է խլել խոսքի 30 վայրկյան ցանկացած խաղացողի."
      },
      
      {
        name: "Հեքիմ",
        possibility: "Կարող է իրեն դեղաբույսեր ավելացնել գույքագրման մեջ կամ ցանկացած խաղացողի նվազեցնել հիվանդության միջին/ծանր աստիճանը 1-ով."
      },
      {
        name: "Գյուտարար",
        possibility: "Երբ անցնում է բունկեր կարող է ստեղծել ավտոմատ ձվի ինկուբատոր."
      },
      
      {
        name: "Նկարազարդող",
        possibility: "Կարող է ավելացնել ֆոբիա/վախ ցանկացած խաղացողի."
      },
      
      {
        name: "Իմունոլոգ",
        possibility: "Կարող է բուժել իմունային համակարգի մեղմ և միջին հիվանդությունները ցանկացած խաղացողի համար: Անխոցելի է վարակիչ հիվանդությունների նկատմամբ."
      },
      
      {
        name: "Ինժեներ",
        possibility: "Երբ անցնում է բունկեր, կարող է ստեղծել սարքավորված ջերմոց ՝ բունկերում բույսեր աճեցնելու համար."
      },
      
      {
        name: "Ինկասատոր",
        possibility: "Կարող է իր ճամպրուկում ավելացնել զրահաբաճկոն."
      },
      
      {
        name: "Տեսուչ",
        possibility: "Կարող է ավելացնել ցանկացած խնդիր բունկերում (էլեկտրաէներգիայի բացակայություն, բորբոս, գայլեր, ջեռուցման խնդիրներ, առնետներ, անօթեւան:..)."
      },

      {
        name: "Պատմաբան",
        possibility: "Կարող է գողանալ ցանկացած բնութագիր վտարված խաղացողից."
      },
      
      {
        name: "Սրտաբան",
        possibility: "Կարող է բուժել սրտանոթային հիվանդությունների հետ կապված հիվանդությունը."
      },
      
      {
        name: "Քարտեզագիր",
        possibility: "Անցնելիս բունկեր կարող է ավելացնել 50 մ2 սենյակ, որտեղ գտնվում են պաշտպանիչ կոստյումներ."
      },
      
      {
        name: "Կասկադյոր",
        possibility: "Կարող է չեղարկել մեկ այլ խաղացողի հատուկ հնարավորության ինքն իրեն ուղղված քարտը."
      },
      
      {
        name: "Գանձապահ",
        possibility: "Եթե կա մոտակայքում առևտրի կենտրոն, կարող է ավելացնել 10 կգ ցանկացած ապրանք ճամպրուկում."
      },
      
      {
        name: "Կիբեռնետիկ",
        possibility: "Կարող է իր ճամպրուկում հզոր Մոնոբլոկ."
      },
      
      {
        name: "Մարդասպան",
        possibility: "Կարող է հիվանդությունը բարձրացնել կրիտիկական աստիճանի խաղացողին իրենից առաջ կամ հետո."
      },
      
      {
        name: "Կլիմայագետ",
        possibility: "Կարող է փոխել կատակլիզմը."
      },
      
      {
        name: "Ծաղրածու",
        possibility: "Կարող է փոխել 'մասնագիտություններ' ժամացույցի սլաքի ուղղությամբ."
      },
      
      {
        name: "Կոլեկտոր",
        possibility: "Կարող է գողանալ ճամպրուկ ցանկացած խաղացողից."
      },
      
      {
        name: "Կոմբայններ",
        possibility: "Կարող է իր ճամպրուկում ավելացնել սերմեր՝ ցանելու համար:"
      },
      
      {
        name: "Կատակերգու",
        possibility: "Կարող է փոխել մարդկային հատկությունը մեկ այլ խաղացողի."
      },
      {
        name: "Հավաքարար",
        possibility: "Կարող է հեռացնել ցանկացած խաղացողի ճամպրուկը ."
      },
      
      {
        name: "Ուրոլոգ",
        possibility: "Կարող է բուժել միզասեռական համակարգի հիվանդության հետ կապված հիվանդությունը: Կրիտիկական աստիճանը նվազում է ծանր աստիճանի."
      },
      
      {
        name: "Աշխարհագրության ուսուցիչ",
        possibility: "Կարող է իր ճամպրուկում ավելացնել տարածքի քարտեզը."
      },
      
      {
        name: "Պատմության ուսուցիչ",
        possibility: "Կարող է փոխել 'Լրացուցիչ մանրամասներ' ցանկացած խաղացողի."
      },
      
      {
        name: "Կրտսեր դպրոցի ուսուցիչ",
        possibility: "Կարող է թույլ տալ, որ երեխաները տեղ չզբաղեցնեն բունկերում."
      },
      {
        name: "Դեղագործ",
        possibility: "Գիտի, թե որտեղ է գտնվում դեղորայքի պահեստը."
      },
      
      {
        name: "Պարամեդիկ",
        possibility: "Կարող է իր ճամպրուկում ավելացել առաջին օգնության մեծ հավաքածու."
      },
      
      {
        name: "Ֆերմեր",
        possibility: "Կարող է ինքն իր ճամպրուկում ավելացնել Ապրանքի տուփ."
      },
      
      {
        name: "Ֆիզիկոս",
        possibility: "Կարող է փոխանակել 'մասնագիտություն' մյուս երկու խաղացողներին."
      },
      
      {
        name: "Փիլիսոփա",
        possibility: "Կարող է փոխել իր մարդկային հատկությունը."
      },
      
      {
        name: "Ֆինանսիստ",
        possibility: "Եթե բունկերում առկա են էլեկտրաէներգիայի կամ ջրամատակարարման հետ կապված որևէ խնդիր, ապա այն կարող է շտկել դրանք."
      },
      
      {
        name: "Ֆոտոգրաֆ",
        possibility: "Ավելացնում է իր ճամպրուկում  տեսախցիկ. Եթե բունկերում առկա են առնետների հետ կապված որևէ խնդիր, ապա այն կարող է շտկել դրանք."
      },
      
      {
        name: "Ֆումելյե",
        possibility: "Կարող է ավելացնել 50 Սիգար ճամպրուկում."
      },
      
      {
        name: "Հակեր",
        possibility: "Կարող է իր ճամպրուկում ավելացնել լիցքավորիչ ունեցող նոութբուք."
      },
      
      {
        name: "Քիմիկ",
        possibility: "Կարող է իր ճամպրուկում ավելացնել քիմիական ռեակտիվներ."
      },
      
      {
        name: "Վիրաբույժ",
        possibility: "Կարող է բուժել ցանկացած հիվանդություն մեկ այլ խաղացողի: 'Չի կարող կիրառվել կրիտիկական աստիճանի  հիվանդություն ունեցող խաղացողի վրա."
      },
      
      {
        name: "Նկարիչ",
        possibility: "Եթե բունկերում առկա են չորության հետ կապված որևէ խնդիր, ապա այն կարող է շտկել դրանք."
      },
      
      {
        name: "Համակարգչային գրաֆիկայի նկարիչ",
        possibility: "Եթե զամբյուղում առկա են օդային ֆիլտրերի հետ կապված որևէ խնդիր, ապա այն կարող է շտկել դրանք."
      },
      
      {
        name: "Ժամագործ",
        possibility: "Կարող է փոխել 'մասնագիտություններ' ժամացույցի սլաքի ուղղությամբ: Օգտագործված մասնագիտական հնարավորությունները չեն կարող կրկին կիրառվել."
      },
      
      {
        name: "Մասնավոր դետեկտիվ",
        possibility: "Կարող է խնդրել մեկ այլ խաղացողի բացել ցանկացած բնութագիր, ցանկության դեպքում կարող է անմիջապես գողանալ այն."
      },
      
      {
        name: "Հանքափոր",
        possibility: "Եթե խաղացողը հարվածում է բունկերին, ավելացնում է 50 մ 2 սենյակ, որտեղ գտնվում են պաշտպանիչ կոստյումները."
      },
      
      {
        name: "Դերձակուհի",
        possibility: "Կարող է իր ճամպրուկում ավելացնել ջերմային հագուստի հավաքածու."
      },
      
      {
        name: "Բնապահպան",
        possibility: "Կարող է իր ճամպրուկում ավելացնել պարարտացված, բերրի հողի տոպրակ."
      },
      
      {
        name: "Տնտեսագետ",
        possibility: "Կարող է 10% - ով ավելացնել սննդի քանակը բունկերում:"
      },
      
      {
        name: "Էլեկտրիկ",
        possibility: "Եթե բունկերում առկա են էլեկտրաէներգիայի հետ կապված որևէ խնդիր, ապա այն կարող է շտկել դրանք."
      },  
            
  ];

  const randomProfession = professions[getRandomInt(professions.length)];
  const randomPossibility = randomProfession.possibility;

  const races = ["Հայ","Ամերիկացի", "Եվրոպացի", "Ասիացի", "Աֆրիկյան", "Լատինաամերիկացի", "Ավստրալացի", "Հնդիկ", "Ինդոնեզացի", "Թուրք", "Չինացի", "Ճապոնացի", "Կորեացի", "Իրանցի", "Իռլանդացի", "Իտալացի"];
  const genders = ["Տղամարդ", "Կին"];
  const healthStates = ["Կատարյալ առողջ", "հիվանդ", "վիրավոր"];
  const humanTraits = ["Հեղինակավոր", "Շփվող", "Նպատակասլաց", "Բարեսիրտ", "Էմպատիկ", "Աշխատասեր", "Ստեղծագործ", "Լավատես", "Համառ", "Անձնուրաց", "Պատասխանատու", "Հավակնոտ", "Ուշադիր", "Համարձակ", "Անկեղծ"];
  const hobbies = ["Ընթերցանություն", "Լող", "նկարչություն", "ճանապարհորդություն", "լուսանկարչություն", "Հեծանվավազք", "խոհարարություն", "այգեգործություն", "լեզուների ուսուցում", " Երաժշտություն (գործիք նվագելը)", "կինո", "ֆիթնես", "աստղագիտության ուսումնասիրություն", "Վայրի բնության ուսումնասիրություն", "տրիկոտաժ/Ասեղնագործություն", "Խոհարարություն", "Պար", "Գեոկաչինգ", "Սեղանի խաղեր խաղալ", "սիրողական ռադիո", "հավաքածուներ", "պատմության և մշակույթի ուսումնասիրություն", "Ֆլորիստիկա", "Երաժշտություն", "Երաժշտություն", "Երաժշտություն", "ֆիթնես", "Աստղագիտություն", "Վայրի բնության ուսումնասիրություն", "հյուսելը / ասեղնագործությունը", "Խոհարարություն", "Պար", "Geocaching", "Սեղանի խաղեր խաղալ", "սիրողական ռադիո", "հավաքածուներ", "պատմության և մշակույթի ուսումնասիրություն", "Ֆլորիստիկա",, "վազք", "մոդելավորում", "Պոեզիա", "ժայռամագլցում", "օտար մշակույթների ուսումնասիրություն"];
  const phobias = ["Արախնոֆոբիա", "Ակրոֆոբիա", "Գիպսոֆոբիա", "Կլաուստրոֆոբիա", "Վիրգինիտիֆոբիա", "Նեկրոֆոբիա", "Տրիպանոֆոբիա", "Տոքսիֆոբիա", "տրիսկաիդեկաֆոբիա", "Հերպետոֆոբիա", "Էմետոֆոբիա", "Միսոֆոբիա", "սոցիալական ֆոբիա", "Տախոֆոբիա", "Ավիաֆոբիա", "Կինեմատոֆոբիա", "այլատյացություն", "ֆոբիա բարձրությունից առաջ", "ֆոբիա ուղղափառ մարդկանց առջև", "ֆոբիա մթությունից առաջ", "ֆոբիա արյունից առաջ", "ֆոբիա կենդանիներից առաջ", "ֆոբիա փոքր տարածություններից առաջ", "ֆոբիա թռիչքներից առաջ", "ֆոբիա հիվանդություններից առաջ", "ֆոբիա փոթորկոտ եղանակից առաջ"];
  const baggages = ["Պահածոների տուփ", "գոյատևման հավաքածու", "Օրագիր", "Լապտեր", "ջրի կրիչ", "վրան", "կողմնացույց", "քայլարշավի փայտ", "արևի կրեմ", "բժշկական առաջին օգնության հավաքածու", "քնի բարձ", "քնապարկ", "տեղանքի քարտեզ", "ծխախոտի տուփ", "Կրակայրիչ", "Խոհանոցային պարագաներ", "գոյատևման Գիրք", "կացին", "մետաղալարերի սղոցարան", "ջրի տուփ",, "ռադիո", "նոութբուք", "մարտկոցների մատակարարում", "դյուրակիր լիցքավորիչ", "քաղաքի քարտեզ", "պլանշետ", "տեսախցիկ", "ուսապարկ", "կարի հավաքածու"];
  
  const randomCharacter = {
    profession: randomProfession.name,
    race: races[getRandomInt(races.length)],
    gender: genders[getRandomInt(genders.length)],
    age: getRandomInt(50) + 20,
    health: healthStates[getRandomInt(healthStates.length)],
    trait: humanTraits[getRandomInt(humanTraits.length)],
    hobby: hobbies[getRandomInt(hobbies.length)],
    phobia: phobias[getRandomInt(phobias.length)],
    baggage: baggages[getRandomInt(baggages.length)],
    additionalInfo: [randomPossibility],
  };

  return randomCharacter;
};

const CharacterRegistration = () => {
  const [character, setCharacter] = useState(null);

  const handleGenerateCharacter = () => {
    const newCharacter = generateRandomCharacter();
    setCharacter(newCharacter);
  };

  return (
    <div className="container">
      <h1>ԲՈՒՆԿԵՐ</h1>
      <button onClick={handleGenerateCharacter}>Ստեղծեք կերպար</button>
      {character && (
        <div className="character-info">
          <p><strong>Մասնագիտություն:</strong> {character.profession}</p>
          <p><strong>Ռասա:</strong> {character.race}</p>
          <p><strong>Սեռ:</strong> {character.gender}</p>
          <p><strong>Տարիք:</strong> {character.age}</p>
          <p><strong>Առողջական վիճակ:</strong> {character.health}</p>
          <p><strong>Մարդկային հատկություն:</strong> {character.trait}</p>
          <p><strong>Հոբբի:</strong> {character.hobby}</p>
          <p><strong>Ֆոբիա:</strong> {character.phobia}</p>
          <p><strong>Ուղեբեռ:</strong> {character.baggage}</p>
          <p><strong>Լրացուցիչ տեղեկություններ:</strong></p>
          <ul>
            {character.additionalInfo.map((info, index) => (
              <li key={index}>{info}</li>
            ))}
          </ul>
        </div>
      )}
    </div>
  );
};

export default CharacterRegistration;
